--------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amalkova/Library/CloudStorage/OneDrive-FloridaInstituteofTechnology/Working santctio
> ns/output/timing/event_study_figure2_log.txt
  log type:  text
 opened on:  10 Feb 2026, 11:04:59

. 
. ********************************************************************************
. * Load and prepare data
. ********************************************************************************
. 
. use "output/timing/rlms_timing_sample.dta", clear

. 
. * Drop and recreate variables
. foreach v in agri period {
  2.     capture drop `v'
  3. }

. 
. gen agri = (industry == 8)

. 
. * Create period: use Aug-Nov for 2014, drop Dec 2014
. gen period = year

. replace period = . if year == 2014 & interview_month < 8
(94 real changes made, 94 to missing)

. replace period = . if year == 2014 & interview_month == 12
(1,116 real changes made, 1,116 to missing)

. keep if period != . & period >= 2011 & period <= 2018
(16,780 observations deleted)

. 
. * Event time relative to 2014
. gen event_time = period - 2014

. 
. * Create interaction dummies (omit t=-1, i.e., 2013)
. gen Dm3 = agri * (event_time == -3)

. gen Dm2 = agri * (event_time == -2)

. gen D0 = agri * (event_time == 0)

. gen D1 = agri * (event_time == 1)

. gen D2 = agri * (event_time == 2)

. gen D3 = agri * (event_time == 3)

. gen D4 = agri * (event_time == 4)

. 
. ********************************************************************************
. * Run event study regression
. ********************************************************************************
. 
. di "Event study regression:"
Event study regression:

. reg ln_wage Dm3 Dm2 D0 D1 D2 D3 D4 agri i.period age age_sq female i.educ_cat, cluster(region)

Linear regression                               Number of obs     =     61,204
                                                F(21, 37)         =     433.74
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2179
                                                Root MSE          =     .61161

                                (Std. err. adjusted for 38 clusters in region)
------------------------------------------------------------------------------
             |               Robust
     ln_wage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         Dm3 |   .0986078   .0413516     2.38   0.022     .0148216     .182394
         Dm2 |   .0475985   .0465686     1.02   0.313    -.0467584    .1419555
          D0 |   .1180459    .044529     2.65   0.012     .0278216    .2082701
          D1 |   .1596173   .0525907     3.04   0.004     .0530584    .2661763
          D2 |   .1527846   .0696474     2.19   0.035     .0116656    .2939036
          D3 |   .1516507   .0605325     2.51   0.017     .0290001    .2743013
          D4 |   .2100867   .0526824     3.99   0.000      .103342    .3168314
        agri |  -.4796172   .0614719    -7.80   0.000    -.6041711   -.3550633
             |
      period |
       2012  |   .1467804   .0133543    10.99   0.000     .1197221    .1738387
       2013  |   .2347679   .0120168    19.54   0.000     .2104195    .2591163
       2014  |   .2952649   .0151243    19.52   0.000     .2646202    .3259096
       2015  |    .358415   .0154236    23.24   0.000     .3271639    .3896662
       2016  |   .4039228   .0180729    22.35   0.000     .3673037     .440542
       2017  |   .4699304   .0167254    28.10   0.000     .4360414    .5038193
       2018  |   .5446725   .0195992    27.79   0.000     .5049607    .5843843
             |
         age |   .0536961   .0046235    11.61   0.000     .0443281    .0630642
      age_sq |  -.0007127   .0000536   -13.30   0.000    -.0008212   -.0006041
      female |  -.4060291   .0163197   -24.88   0.000     -.439096   -.3729621
             |
    educ_cat |
          2  |   .4060378   .1739097     2.33   0.025     .0536633    .7584124
          3  |   .4959617    .175134     2.83   0.007     .1411065     .850817
          4  |   .7597526    .182451     4.16   0.000     .3900718    1.129433
             |
       _cons |   8.174437   .2031879    40.23   0.000     7.762739    8.586135
------------------------------------------------------------------------------

. 
. * Store results
. local b_m3 = _b[Dm3]

. local b_m2 = _b[Dm2]

. local b_0 = _b[D0]

. local b_1 = _b[D1]

. local b_2 = _b[D2]

. local b_3 = _b[D3]

. local b_4 = _b[D4]

. 
. local se_m3 = _se[Dm3]

. local se_m2 = _se[Dm2]

. local se_0 = _se[D0]

. local se_1 = _se[D1]

. local se_2 = _se[D2]

. local se_3 = _se[D3]

. local se_4 = _se[D4]

. 
. di ""


. di "Coefficients:"
Coefficients:

. di "  2011 (t=-3): " %6.4f `b_m3' " (SE: " %6.4f `se_m3' ")"
  2011 (t=-3): 0.0986 (SE: 0.0414)

. di "  2012 (t=-2): " %6.4f `b_m2' " (SE: " %6.4f `se_m2' ")"
  2012 (t=-2): 0.0476 (SE: 0.0466)

. di "  2013 (t=-1): Reference"
  2013 (t=-1): Reference

. di "  2014 (t=0):  " %6.4f `b_0' " (SE: " %6.4f `se_0' ") *** KEY: Aug-Nov only ***"
  2014 (t=0):  0.1180 (SE: 0.0445) *** KEY: Aug-Nov only ***

. di "  2015 (t=1):  " %6.4f `b_1' " (SE: " %6.4f `se_1' ")"
  2015 (t=1):  0.1596 (SE: 0.0526)

. di "  2016 (t=2):  " %6.4f `b_2' " (SE: " %6.4f `se_2' ")"
  2016 (t=2):  0.1528 (SE: 0.0696)

. di "  2017 (t=3):  " %6.4f `b_3' " (SE: " %6.4f `se_3' ")"
  2017 (t=3):  0.1517 (SE: 0.0605)

. di "  2018 (t=4):  " %6.4f `b_4' " (SE: " %6.4f `se_4' ")"
  2018 (t=4):  0.2101 (SE: 0.0527)

. 
. ********************************************************************************
. * Create plotting dataset
. ********************************************************************************
. 
. preserve

. clear

. set obs 8
Number of observations (_N) was 0, now 8.

. 
. * Event time
. gen event_time = _n - 4  // -3 to 4

. 
. * Coefficients
. gen coef = .
(8 missing values generated)

. replace coef = `b_m3' if event_time == -3
(1 real change made)

. replace coef = `b_m2' if event_time == -2
(1 real change made)

. replace coef = 0 if event_time == -1
(1 real change made)

. replace coef = `b_0' if event_time == 0
(1 real change made)

. replace coef = `b_1' if event_time == 1
(1 real change made)

. replace coef = `b_2' if event_time == 2
(1 real change made)

. replace coef = `b_3' if event_time == 3
(1 real change made)

. replace coef = `b_4' if event_time == 4
(1 real change made)

. 
. * Standard errors
. gen se = .
(8 missing values generated)

. replace se = `se_m3' if event_time == -3
(1 real change made)

. replace se = `se_m2' if event_time == -2
(1 real change made)

. replace se = 0 if event_time == -1
(1 real change made)

. replace se = `se_0' if event_time == 0
(1 real change made)

. replace se = `se_1' if event_time == 1
(1 real change made)

. replace se = `se_2' if event_time == 2
(1 real change made)

. replace se = `se_3' if event_time == 3
(1 real change made)

. replace se = `se_4' if event_time == 4
(1 real change made)

. 
. * Confidence intervals
. gen ci_lo = coef - 1.96*se

. gen ci_hi = coef + 1.96*se

. 
. * Year labels
. gen year = event_time + 2014

. 
. * List
. list event_time year coef se ci_lo ci_hi

     +--------------------------------------------------------------+
     | event_~e   year       coef         se       ci_lo      ci_hi |
     |--------------------------------------------------------------|
  1. |       -3   2011   .0986078   .0413516    .0175587   .1796569 |
  2. |       -2   2012   .0475985   .0465686   -.0436759    .138873 |
  3. |       -1   2013          0          0           0          0 |
  4. |        0   2014   .1180459    .044529    .0307691   .2053227 |
  5. |        1   2015   .1596173   .0525907    .0565395   .2626952 |
     |--------------------------------------------------------------|
  6. |        2   2016   .1527846   .0696474    .0162758   .2892935 |
  7. |        3   2017   .1516507   .0605325    .0330069   .2702945 |
  8. |        4   2018   .2100867   .0526824    .1068292   .3133442 |
     +--------------------------------------------------------------+

. 
. ********************************************************************************
. * Figure 1: Main event study with annotations
. ********************************************************************************
. 
. twoway (rarea ci_lo ci_hi event_time, fcolor(navy%20) lcolor(navy%0)) ///
>        (connected coef event_time, lcolor(navy) lpattern(solid) lwidth(medthick) ///
>            msymbol(circle) mcolor(navy) msize(medlarge)), ///
>     xline(-0.5, lcolor(cranberry) lpattern(dash) lwidth(medthick)) ///
>     xline(0.4, lcolor(orange) lpattern(shortdash) lwidth(medthick)) ///
>     yline(0, lcolor(gs10) lpattern(solid)) ///
>     xlabel(-3 "2011" -2 "2012" -1 "2013" 0 "2014" 1 "2015" 2 "2016" 3 "2017" 4 "2018", ///
>            labsize(medium)) ///
>     ylabel(-0.15(0.05)0.3, format(%4.2f) labsize(medium) angle(horizontal)) ///
>     xtitle("Year", size(medlarge)) ///
>     ytitle("Effect on Log Wages (relative to 2013)", size(medlarge)) ///
>     title("Event Study: Agricultural vs. Other Sectors", size(large)) ///
>     text(0.27 -0.5 "Embargo" "(Aug 6)", size(small) color(cranberry) placement(e)) ///
>     text(0.27 0.5 "Crash" "(Dec 16)", size(small) color(orange) placement(e)) ///
>     note("Notes: 2014 coefficient uses October-November interviews only (after embargo, before Decembe
> r crash)." ///
>          "Reference year: 2013. Shaded area = 95% CI. Standard errors clustered by region.", size(smal
> l)) ///
>     legend(off) ///
>     graphregion(color(white)) ///
>     plotregion(margin(small))

. 
. graph export "output/timing/event_study_main.png", replace width(1600) height(1100)
file /Users/amalkova/Library/CloudStorage/OneDrive-FloridaInstituteofTechnology/Working
    santctions/output/timing/event_study_main.png saved as PNG format

. graph export "output/timing/event_study_main.pdf", replace
file /Users/amalkova/Library/CloudStorage/OneDrive-FloridaInstituteofTechnology/Working
    santctions/output/timing/event_study_main.pdf saved as PDF format

. 
. ********************************************************************************
. * Figure 2: Publication-ready version
. ********************************************************************************
. 
. twoway (rcap ci_lo ci_hi event_time, lcolor(navy) lwidth(medium)) ///
>        (scatter coef event_time, mcolor(navy) msymbol(circle) msize(large)) ///
>        (connected coef event_time, lcolor(navy) lpattern(solid) lwidth(medium) msymbol(none)), ///
>     xline(-0.5, lcolor(red*0.8) lpattern(dash) lwidth(medium)) ///
>     xline(0.4, lcolor(orange) lpattern(shortdash) lwidth(medium)) ///
>     yline(0, lcolor(gs12) lpattern(solid)) ///
>     xlabel(-3 "2011" -2 "2012" -1 "2013" 0 `" "2014" "(Oct-Nov)" "' 1 "2015" 2 "2016" 3 "2017" 4 "2018
> ", ///
>            labsize(medsmall)) ///
>     ylabel(-0.15(0.05)0.3, format(%4.2f) labsize(medsmall) angle(horizontal) grid) ///
>     xtitle("Year", size(medium)) ///
>     ytitle("Coefficient" "(Agricultural Wage Premium)", size(medium)) ///
>     title("Figure X: Event Study - Timing of Agricultural Wage Effects", size(medlarge)) ///
>     subtitle("Effects Appear Before December 2014 Ruble Crash", size(medium) color(gs6)) ///
>     note("Notes: Red dashed line marks August 6, 2014 food embargo announcement. Orange dashed line ma
> rks December 16, 2014" ///
>          "'Black Tuesday' ruble crash. The 2014 coefficient is estimated using only October-November i
> nterviews, capturing the" ///
>          "period after the embargo but before the major currency depreciation. Reference period: 2013.
>  Bars show 95% confidence" ///
>          "intervals. Standard errors clustered at the region level. Sample restricted to employed work
> ers aged 18-65.", ///
>          size(vsmall)) ///
>     legend(off) ///
>     graphregion(color(white)) ///
>     plotregion(margin(small))
type mismatch
r(109);

end of do-file
r(109);
