------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amalkova/Library/CloudStorage/OneDrive-FloridaInstituteofTechnology/Wo
> rking santctions/output/analysis_sample_size_log.txt
  log type:  text
 opened on:   7 Feb 2026, 12:11:23

. 
. * Load analysis sample
. use "output/rlms_analysis_sample.dta", clear

. 
. ********************************************************************************
. * PART 1: Overall Sample Sizes by Year and Sector
. ********************************************************************************
. 
. di ""


. di "======================================================================"
======================================================================

. di "PART 1: SAMPLE SIZES BY YEAR AND SECTOR"
PART 1: SAMPLE SIZES BY YEAR AND SECTOR

. di "======================================================================"
======================================================================

. 
. * Agricultural workers by year
. preserve

. keep if agri == 1
(101,003 observations deleted)

. tab year, matcell(agri_counts)

       Year |      Freq.     Percent        Cum.
------------+-----------------------------------
       2010 |        430       10.39       10.39
       2011 |        422       10.20       20.58
       2012 |        413        9.98       30.56
       2013 |        368        8.89       39.45
       2014 |        273        6.60       46.05
       2015 |        253        6.11       52.16
       2016 |        261        6.31       58.47
       2017 |        276        6.67       65.14
       2018 |        264        6.38       71.51
       2019 |        244        5.90       77.41
       2020 |        242        5.85       83.26
       2021 |        233        5.63       88.89
       2022 |        224        5.41       94.30
       2023 |        236        5.70      100.00
------------+-----------------------------------
      Total |      4,139      100.00

. di ""


. di "Agricultural workers by year:"
Agricultural workers by year:

. tab year

       Year |      Freq.     Percent        Cum.
------------+-----------------------------------
       2010 |        430       10.39       10.39
       2011 |        422       10.20       20.58
       2012 |        413        9.98       30.56
       2013 |        368        8.89       39.45
       2014 |        273        6.60       46.05
       2015 |        253        6.11       52.16
       2016 |        261        6.31       58.47
       2017 |        276        6.67       65.14
       2018 |        264        6.38       71.51
       2019 |        244        5.90       77.41
       2020 |        242        5.85       83.26
       2021 |        233        5.63       88.89
       2022 |        224        5.41       94.30
       2023 |        236        5.70      100.00
------------+-----------------------------------
      Total |      4,139      100.00

. restore

. 
. * Total sample by year
. tab year agri, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Agriculture sector
      Year |         0          1 |     Total
-----------+----------------------+----------
      2010 |     8,181        430 |     8,611 
           |     95.01       4.99 |    100.00 
-----------+----------------------+----------
      2011 |     8,308        422 |     8,730 
           |     95.17       4.83 |    100.00 
-----------+----------------------+----------
      2012 |     8,616        413 |     9,029 
           |     95.43       4.57 |    100.00 
-----------+----------------------+----------
      2013 |     8,323        368 |     8,691 
           |     95.77       4.23 |    100.00 
-----------+----------------------+----------
      2014 |     7,086        273 |     7,359 
           |     96.29       3.71 |    100.00 
-----------+----------------------+----------
      2015 |     6,897        253 |     7,150 
           |     96.46       3.54 |    100.00 
-----------+----------------------+----------
      2016 |     7,036        261 |     7,297 
           |     96.42       3.58 |    100.00 
-----------+----------------------+----------
      2017 |     6,990        276 |     7,266 
           |     96.20       3.80 |    100.00 
-----------+----------------------+----------
      2018 |     6,739        264 |     7,003 
           |     96.23       3.77 |    100.00 
-----------+----------------------+----------
      2019 |     6,715        244 |     6,959 
           |     96.49       3.51 |    100.00 
-----------+----------------------+----------
      2020 |     6,443        242 |     6,685 
           |     96.38       3.62 |    100.00 
-----------+----------------------+----------
      2021 |     6,544        233 |     6,777 
           |     96.56       3.44 |    100.00 
-----------+----------------------+----------
      2022 |     6,601        224 |     6,825 
           |     96.72       3.28 |    100.00 
-----------+----------------------+----------
      2023 |     6,524        236 |     6,760 
           |     96.51       3.49 |    100.00 
-----------+----------------------+----------
     Total |   101,003      4,139 |   105,142 
           |     96.06       3.94 |    100.00 

. 
. * Baseline (2013) sample size
. di ""


. di "Baseline (2013) sample:"
Baseline (2013) sample:

. count if year == 2013 & agri == 1
  368

. local n_agri_2013 = r(N)

. count if year == 2013 & agri == 0
  8,323

. local n_other_2013 = r(N)

. di "Agricultural workers: `n_agri_2013'"
Agricultural workers: 368

. di "Other sector workers: `n_other_2013'"
Other sector workers: 8323

. 
. * Primary sample period (2010-2019)
. di ""


. di "Primary sample period (2010-2019):"
Primary sample period (2010-2019):

. count if year >= 2010 & year <= 2019 & agri == 1
  3,204

. local n_agri_primary = r(N)

. count if year >= 2010 & year <= 2019 & agri == 0
  74,891

. local n_other_primary = r(N)

. di "Agricultural worker-years: `n_agri_primary'"
Agricultural worker-years: 3204

. di "Other sector worker-years: `n_other_primary'"
Other sector worker-years: 74891

. 
. * Unique individuals
. preserve

. keep if year >= 2010 & year <= 2019
(27,047 observations deleted)

. bysort idind: gen first = _n == 1

. count if first == 1 & agri == 1
  766

. di "Unique agricultural workers (ever in agri): " r(N)
Unique agricultural workers (ever in agri): 766

. restore

. 
. ********************************************************************************
. * PART 2: Sub-sector Analysis - What's Available?
. ********************************************************************************
. 
. di ""


. di "======================================================================"
======================================================================

. di "PART 2: SUB-SECTOR CLASSIFICATION CHECK"
PART 2: SUB-SECTOR CLASSIFICATION CHECK

. di "======================================================================"
======================================================================

. 
. * Check what detailed industry variables exist
. di ""


. di "Checking for detailed industry codes..."
Checking for detailed industry codes...

. 
. * j4_1 is the main industry code
. describe j4*
