------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amalkova/Library/CloudStorage/OneDrive-FloridaInstituteofTechnology/Wo
> rking santctions/output/analysis_synthetic_control_robust_log.txt
  log type:  text
 opened on:   7 Feb 2026, 16:24:55

. 
. di "======================================================================"
======================================================================

. di "ROBUST SYNTHETIC CONTROL ANALYSIS"
ROBUST SYNTHETIC CONTROL ANALYSIS

. di "======================================================================"
======================================================================

. 
. ********************************************************************************
. * STEP 1: Prepare sector-level panel data
. ********************************************************************************
. 
. use "output/rlms_analysis_sample.dta", clear

. keep if year >= 2010 & year <= 2019
(27,047 observations deleted)

. 
. * Create sector variable from industry
. gen sector = industry

. drop if sector == .
(0 observations deleted)

. 
. * Collapse to sector-year level
. collapse (mean) ln_wage hours_month (count) n_obs = ln_wage, by(sector year)

. 
. * Keep only sectors with sufficient observations
. bys sector: egen min_n = min(n_obs)

. keep if min_n >= 50
(104 observations deleted)

. drop min_n

. 
. * Reshape to wide format
. reshape wide ln_wage hours_month n_obs, i(year) j(sector)
(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                      170   ->      10
Number of variables                   5   ->      52
j variable (17 values)           sector   ->   (dropped)
xij variables:
                                ln_wage   ->   ln_wage1 ln_wage2 ... ln_wage17
                            hours_month   ->   hours_month1 hours_month2 ... hours_month17
                                  n_obs   ->   n_obs1 n_obs2 ... n_obs17
-----------------------------------------------------------------------------

. 
. * Rename key sectors
. rename ln_wage8 ln_wage_agri

. rename ln_wage1 ln_wage_food

. rename ln_wage6 ln_wage_constr

. rename ln_wage7 ln_wage_transport

. rename ln_wage9 ln_wage_govt

. rename ln_wage10 ln_wage_educ

. rename ln_wage12 ln_wage_health

. rename ln_wage14 ln_wage_trade

. 
. di _n "=== Sector wages by year ==="

=== Sector wages by year ===

. list year ln_wage_agri ln_wage_food ln_wage_constr ln_wage_educ ln_wage_trade

     +-------------------------------------------------------------+
     | year   ln_wag~i   ln_wag~d   ln_wag~r   ln_wag~c   ln_wag~e |
     |-------------------------------------------------------------|
  1. | 2010   8.919818   9.314483    9.68518   9.034489   9.355267 |
  2. | 2011   9.102503     9.4985   9.792269   9.166473   9.467219 |
  3. | 2012   9.189533   9.581774   9.942157   9.323518   9.594646 |
  4. | 2013   9.243885   9.702696   9.998844   9.507995   9.698905 |
  5. | 2014   9.418563    9.81576    10.0877   9.582243   9.767715 |
     |-------------------------------------------------------------|
  6. | 2015   9.543257   9.864334   10.12332   9.623257   9.804289 |
  7. | 2016   9.593905   9.917538   10.12969   9.683211   9.873449 |
  8. | 2017   9.649827   9.923919   10.23319   9.690583   9.976662 |
  9. | 2018   9.798817   9.977983   10.31632   9.840842   10.03601 |
 10. | 2019   9.902315   10.08737   10.39368   9.929087   10.10459 |
     +-------------------------------------------------------------+

. 
. ********************************************************************************
. * STEP 2: Construct Multiple Synthetic Controls
. ********************************************************************************
. 
. di ""


. di "======================================================================"
======================================================================

. di "STEP 2: CONSTRUCT SYNTHETIC CONTROLS"
STEP 2: CONSTRUCT SYNTHETIC CONTROLS

. di "======================================================================"
======================================================================

. 
. * Method 1: Simple average (baseline)
. gen synth_simple = (ln_wage_food + ln_wage_constr + ln_wage_transport + ///
>                     ln_wage_govt + ln_wage_educ + ln_wage_health + ln_wage_trade) / 7

. 
. * Method 2: Match on pre-treatment mean + track deviations
. egen pre_mean_agri = mean(ln_wage_agri) if year <= 2013
(6 missing values generated)

. egen pre_mean_food = mean(ln_wage_food) if year <= 2013
(6 missing values generated)

. egen pre_mean_constr = mean(ln_wage_constr) if year <= 2013
(6 missing values generated)

. egen pre_mean_educ = mean(ln_wage_educ) if year <= 2013
(6 missing values generated)

. egen pre_mean_trade = mean(ln_wage_trade) if year <= 2013
(6 missing values generated)

. 
. * Fill for all years
. foreach v in pre_mean_agri pre_mean_food pre_mean_constr pre_mean_educ pre_mean_trade {
  2.     egen temp = max(`v')
  3.     replace `v' = temp
  4.     drop temp
  5. }
(6 real changes made)
(6 real changes made)
(6 real changes made)
(6 real changes made)
(6 real changes made)

. 
. * Deviations from pre-treatment mean
. gen dev_food = ln_wage_food - pre_mean_food

. gen dev_constr = ln_wage_constr - pre_mean_constr

. gen dev_educ = ln_wage_educ - pre_mean_educ

. gen dev_trade = ln_wage_trade - pre_mean_trade

. 
. * Synthetic = agri pre-mean + average deviation
. gen synth_matched = pre_mean_agri + (dev_food + dev_constr + dev_educ + dev_trade)/4

. 
. * Method 3: Weighted by inverse distance to agriculture
. * Get pre-treatment distance from agriculture
. local dist_food = abs(`=pre_mean_food[1]' - `=pre_mean_agri[1]')

. local dist_constr = abs(`=pre_mean_constr[1]' - `=pre_mean_agri[1]')

. local dist_educ = abs(`=pre_mean_educ[1]' - `=pre_mean_agri[1]')

. local dist_trade = abs(`=pre_mean_trade[1]' - `=pre_mean_agri[1]')

. 
. * Inverse distance weights
. local w_food = 1/`dist_food'

. local w_constr = 1/`dist_constr'

. local w_educ = 1/`dist_educ'

. local w_trade = 1/`dist_trade'

. local w_sum = `w_food' + `w_constr' + `w_educ' + `w_trade'

. 
. di _n "=== Inverse Distance Weights ==="

=== Inverse Distance Weights ===

. di "Food: " %5.3f `w_food'/`w_sum'
Food: 0.186

. di "Construction: " %5.3f `w_constr'/`w_sum'
Construction: 0.103

. di "Education: " %5.3f `w_educ'/`w_sum'
Education: 0.528

. di "Trade: " %5.3f `w_trade'/`w_sum'
Trade: 0.183

. 
. gen synth_weighted = pre_mean_agri + ///
>     ((`w_food'/`w_sum')*dev_food + (`w_constr'/`w_sum')*dev_constr + ///
>      (`w_educ'/`w_sum')*dev_educ + (`w_trade'/`w_sum')*dev_trade)

. 
. ********************************************************************************
. * STEP 3: Calculate Pre-Treatment Fit (MSPE)
. ********************************************************************************
. 
. di ""


. di "======================================================================"
======================================================================

. di "STEP 3: PRE-TREATMENT FIT DIAGNOSTICS"
STEP 3: PRE-TREATMENT FIT DIAGNOSTICS

. di "======================================================================"
======================================================================

. 
. * Calculate gaps
. gen gap_simple = ln_wage_agri - synth_simple

. gen gap_matched = ln_wage_agri - synth_matched

. gen gap_weighted = ln_wage_agri - synth_weighted

. 
. * Pre-treatment MSPE
. gen gap_sq_simple = gap_simple^2

. gen gap_sq_matched = gap_matched^2

. gen gap_sq_weighted = gap_weighted^2

. 
. di _n "=== Pre-Treatment Mean Squared Prediction Error ==="

=== Pre-Treatment Mean Squared Prediction Error ===

. sum gap_sq_simple if year <= 2013

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gap_sq_sim~e |          4     .169071    .0286472   .1313006   .1990829

. local mspe_simple_pre = r(mean)

. di "Simple average MSPE (pre): " %8.6f `mspe_simple_pre'
Simple average MSPE (pre): 0.169071

. 
. sum gap_sq_matched if year <= 2013

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gap_sq_mat~d |          4    .0013844     .001599   2.95e-09   .0030951

. local mspe_matched_pre = r(mean)

. di "Matched MSPE (pre): " %8.6f `mspe_matched_pre'
Matched MSPE (pre): 0.001384

. 
. sum gap_sq_weighted if year <= 2013

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gap_sq_wei~d |          4    .0025898    .0031113   .0000876   .0065796

. local mspe_weighted_pre = r(mean)

. di "Weighted MSPE (pre): " %8.6f `mspe_weighted_pre'
Weighted MSPE (pre): 0.002590

. 
. * Post-treatment MSPE
. di _n "=== Post-Treatment Mean Squared Prediction Error ==="

=== Post-Treatment Mean Squared Prediction Error ===

. sum gap_sq_simple if year >= 2014

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gap_sq_sim~e |          6    .0809698    .0306051   .0484933   .1354893

. local mspe_simple_post = r(mean)

. di "Simple average MSPE (post): " %8.6f `mspe_simple_post'
Simple average MSPE (post): 0.080970

. 
. sum gap_sq_matched if year >= 2014

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gap_sq_mat~d |          6    .0197047    .0145814   .0010758   .0404905

. local mspe_matched_post = r(mean)

. di "Matched MSPE (post): " %8.6f `mspe_matched_post'
Matched MSPE (post): 0.019705

. 
. sum gap_sq_weighted if year >= 2014

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gap_sq_wei~d |          6    .0136226    .0104194   .0001347   .0283938

. local mspe_weighted_post = r(mean)

. di "Weighted MSPE (post): " %8.6f `mspe_weighted_post'
Weighted MSPE (post): 0.013623

. 
. * RMSPE ratios
. di _n "=== RMSPE Ratios (Post/Pre) ==="

=== RMSPE Ratios (Post/Pre) ===

. di "Simple: " %6.2f sqrt(`mspe_simple_post')/sqrt(`mspe_simple_pre')
Simple:   0.69

. di "Matched: " %6.2f sqrt(`mspe_matched_post')/sqrt(`mspe_matched_pre')
Matched:   3.77

. di "Weighted: " %6.2f sqrt(`mspe_weighted_post')/sqrt(`mspe_weighted_pre')
Weighted:   2.29

. 
. * Year-by-year gaps for best method (matched)
. di _n "=== Year-by-Year Gaps (Matched Method) ==="

=== Year-by-Year Gaps (Matched Method) ===

. list year ln_wage_agri synth_matched gap_matched

     +----------------------------------------+
     | year   ln_wag~i   synt~hed   gap_mat~d |
     |----------------------------------------|
  1. | 2010   8.919818   8.919764    .0000544 |
  2. | 2011   9.102503   9.053524    .0489788 |
  3. | 2012   9.189533   9.182932    .0066013 |
  4. | 2013   9.243885   9.299519   -.0556335 |
  5. | 2014   9.418563   9.385763    .0327997 |
     |----------------------------------------|
  6. | 2015   9.543257   9.426208    .1170483 |
  7. | 2016   9.593905   9.473381    .1205244 |
  8. | 2017   9.649827   9.528499    .1213284 |
  9. | 2018   9.798817     9.6152    .1836166 |
 10. | 2019   9.902315   9.701093    .2012224 |
     +----------------------------------------+

. 
. ********************************************************************************
. * STEP 4: Pre-Treatment Fit Quality Assessment
. ********************************************************************************
. 
. di ""


. di "======================================================================"
======================================================================

. di "STEP 4: PRE-TREATMENT FIT QUALITY"
STEP 4: PRE-TREATMENT FIT QUALITY

. di "======================================================================"
======================================================================

. 
. * Calculate pre-treatment gap statistics
. sum gap_matched if year <= 2013

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 gap_matched |          4    2.38e-07    .0429635  -.0556335   .0489788

. local pre_mean = r(mean)

. local pre_sd = r(sd)

. local pre_min = r(min)

. local pre_max = r(max)

. 
. di "Pre-treatment gap statistics (matched):"
Pre-treatment gap statistics (matched):

. di "  Mean: " %7.4f `pre_mean'
  Mean:  0.0000

. di "  SD: " %7.4f `pre_sd'
  SD:  0.0430

. di "  Range: [" %6.4f `pre_min' ", " %6.4f `pre_max' "]"
  Range: [-0.0556, 0.0490]

. di "  RMSPE: " %7.4f sqrt(`mspe_matched_pre')
  RMSPE:  0.0372

. 
. * Is pre-treatment fit acceptable?
. * Rule of thumb: RMSPE < 0.05 (5% of outcome SD)
. sum ln_wage_agri

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
ln_wage_agri |         10    9.436242     .317432   8.919818   9.902315

. local outcome_sd = r(sd)

. local rmspe_ratio = sqrt(`mspe_matched_pre') / `outcome_sd'

. di _n "RMSPE as fraction of outcome SD: " %5.3f `rmspe_ratio'

RMSPE as fraction of outcome SD: 0.117

. if `rmspe_ratio' < 0.1 {
.     di "  --> Pre-treatment fit is ACCEPTABLE"
. }

. else {
.     di "  --> Pre-treatment fit is POOR - interpret with caution"
  --> Pre-treatment fit is POOR - interpret with caution
. }

. 
. ********************************************************************************
. * STEP 5: Placebo Tests - Treat Each Control Sector as "Treated"
. ********************************************************************************
. 
. di ""


. di "======================================================================"
======================================================================

. di "STEP 5: PLACEBO TESTS (IN-SPACE)"
STEP 5: PLACEBO TESTS (IN-SPACE)

. di "======================================================================"
======================================================================

. 
. * For each control sector, construct synthetic and calculate RMSPE ratio
. tempname placebo_results

. postfile `placebo_results' str20 sector rmspe_pre rmspe_post ratio using "output/tables/
> synth_placebo_results.dta", replace
(note: file output/tables/synth_placebo_results.dta not found)

. 
. * Agriculture (actual treated unit)
. local rmspe_pre = sqrt(`mspe_matched_pre')

. local rmspe_post = sqrt(`mspe_matched_post')

. local ratio = `rmspe_post' / `rmspe_pre'

. post `placebo_results' ("Agriculture") (`rmspe_pre') (`rmspe_post') (`ratio')

. 
. * Placebo 1: Food Industry
. gen synth_food = pre_mean_food + (dev_constr + dev_educ + dev_trade)/3

. gen gap_food = ln_wage_food - synth_food

. gen gap_sq_food = gap_food^2

. sum gap_sq_food if year <= 2013

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 gap_sq_food |          4    .0007232    .0009431   .0000935   .0021218

. local mspe_pre = r(mean)

. sum gap_sq_food if year >= 2014

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 gap_sq_food |          6    .0015899    .0013241   .0004004   .0040355

. local mspe_post = r(mean)

. local ratio = sqrt(`mspe_post') / sqrt(`mspe_pre')

. post `placebo_results' ("Food Industry") (sqrt(`mspe_pre')) (sqrt(`mspe_post')) (`ratio'
> )

. di "Food Industry RMSPE ratio: " %6.2f `ratio'
Food Industry RMSPE ratio:   1.48

. 
. * Placebo 2: Construction
. gen synth_constr = pre_mean_constr + (dev_food + dev_educ + dev_trade)/3

. gen gap_constr_p = ln_wage_constr - synth_constr

. gen gap_sq_constr = gap_constr_p^2

. sum gap_sq_constr if year <= 2013

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gap_sq_con~r |          4    .0011866    .0013125   6.64e-06   .0030401

. local mspe_pre = r(mean)

. sum gap_sq_constr if year >= 2014

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gap_sq_con~r |          6    .0046486    .0039731   .0023017   .0126548

. local mspe_post = r(mean)

. local ratio = sqrt(`mspe_post') / sqrt(`mspe_pre')

. post `placebo_results' ("Construction") (sqrt(`mspe_pre')) (sqrt(`mspe_post')) (`ratio')

. di "Construction RMSPE ratio: " %6.2f `ratio'
Construction RMSPE ratio:   1.98

. 
. * Placebo 3: Education
. gen synth_educ = pre_mean_educ + (dev_food + dev_constr + dev_trade)/3

. gen gap_educ_p = ln_wage_educ - synth_educ

. gen gap_sq_educ = gap_educ_p^2

. sum gap_sq_educ if year <= 2013

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 gap_sq_educ |          4    .0026621    .0032165    .000023   .0073483

. local mspe_pre = r(mean)

. sum gap_sq_educ if year >= 2014

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 gap_sq_educ |          6    .0070575    .0045516   .0005697   .0124873

. local mspe_post = r(mean)

. local ratio = sqrt(`mspe_post') / sqrt(`mspe_pre')

. post `placebo_results' ("Education") (sqrt(`mspe_pre')) (sqrt(`mspe_post')) (`ratio')

. di "Education RMSPE ratio: " %6.2f `ratio'
Education RMSPE ratio:   1.63

. 
. * Placebo 4: Trade
. gen synth_trade = pre_mean_trade + (dev_food + dev_constr + dev_educ)/3

. gen gap_trade_p = ln_wage_trade - synth_trade

. gen gap_sq_trade = gap_trade_p^2

. sum gap_sq_trade if year <= 2013

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gap_sq_trade |          4    .0003007    .0003562   3.38e-06    .000742

. local mspe_pre = r(mean)

. sum gap_sq_trade if year >= 2014

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gap_sq_trade |          6    .0011712    .0010491   .0000586    .002433

. local mspe_post = r(mean)

. local ratio = sqrt(`mspe_post') / sqrt(`mspe_pre')

. post `placebo_results' ("Trade") (sqrt(`mspe_pre')) (sqrt(`mspe_post')) (`ratio')

. di "Trade RMSPE ratio: " %6.2f `ratio'
Trade RMSPE ratio:   1.97

. 
. postclose `placebo_results'

. 
. * Display and calculate p-value
. preserve

. use "output/tables/synth_placebo_results.dta", clear

. di _n "=== Placebo Test Results ==="

=== Placebo Test Results ===

. list, sep(0)

     +------------------------------------------------+
     |        sector   rmspe_~e   rmspe_~t      ratio |
     |------------------------------------------------|
  1. |   Agriculture   .0372075   .1403735    3.77272 |
  2. | Food Industry   .0268917   .0398738   1.482755 |
  3. |  Construction   .0344463   .0681807   1.979329 |
  4. |     Education   .0515958   .0840087   1.628207 |
  5. |         Trade    .017342   .0342222   1.973375 |
     +------------------------------------------------+

. 
. * Calculate p-value: proportion of placebos with ratio >= agriculture
. count if ratio >= ratio[1] & sector != "Agriculture"
  0

. local n_larger = r(N)

. count if sector != "Agriculture"
  4

. local n_placebos = r(N)

. local pval = (`n_larger' + 1) / (`n_placebos' + 1)

. di _n "Placebo p-value: " %5.3f `pval'

Placebo p-value: 0.200

. di "  (`n_larger' of `n_placebos' placebos have ratio >= agriculture)"
  (0 of 4 placebos have ratio >= agriculture)

. restore

. 
. ********************************************************************************
. * STEP 6: In-Time Placebo (Fake Treatment in 2012)
. ********************************************************************************
. 
. di ""


. di "======================================================================"
======================================================================

. di "STEP 6: IN-TIME PLACEBO (FAKE 2012 TREATMENT)"
STEP 6: IN-TIME PLACEBO (FAKE 2012 TREATMENT)

. di "======================================================================"
======================================================================

. 
. * Pretend treatment happened in 2012
. * Pre-treatment: 2010-2011, Post-treatment: 2012-2013
. 
. * Calculate MSPE for fake pre-period (2010-2011)
. sum gap_sq_matched if year <= 2011

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gap_sq_mat~d |          2    .0011995    .0016963   2.95e-09   .0023989

. local mspe_fake_pre = r(mean)

. 
. * Calculate MSPE for fake post-period (2012-2013)
. sum gap_sq_matched if year >= 2012 & year <= 2013

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gap_sq_mat~d |          2    .0015693    .0021577   .0000436   .0030951

. local mspe_fake_post = r(mean)

. 
. local fake_ratio = sqrt(`mspe_fake_post') / sqrt(`mspe_fake_pre')

. 
. di "Fake 2012 treatment:"
Fake 2012 treatment:

. di "  Pre-RMSPE (2010-2011): " %7.4f sqrt(`mspe_fake_pre')
  Pre-RMSPE (2010-2011):  0.0346

. di "  Post-RMSPE (2012-2013): " %7.4f sqrt(`mspe_fake_post')
  Post-RMSPE (2012-2013):  0.0396

. di "  Ratio: " %6.2f `fake_ratio'
  Ratio:   1.14

. 
. * Compare to actual 2014 treatment
. local actual_ratio = sqrt(`mspe_matched_post') / sqrt(`mspe_matched_pre')

. di _n "Actual 2014 treatment:"

Actual 2014 treatment:

. di "  Pre-RMSPE (2010-2013): " %7.4f sqrt(`mspe_matched_pre')
  Pre-RMSPE (2010-2013):  0.0372

. di "  Post-RMSPE (2014-2019): " %7.4f sqrt(`mspe_matched_post')
  Post-RMSPE (2014-2019):  0.1404

. di "  Ratio: " %6.2f `actual_ratio'
  Ratio:   3.77

. 
. if `actual_ratio' > `fake_ratio' * 2 {
.     di _n "  --> Actual treatment effect is meaningfully larger than fake"

  --> Actual treatment effect is meaningfully larger than fake
. }

. else {
.     di _n "  --> WARNING: Actual effect not much larger than fake treatment"
. }

. 
. ********************************************************************************
. * STEP 7: Treatment Effect Estimates
. ********************************************************************************
. 
. di ""


. di "======================================================================"
======================================================================

. di "STEP 7: TREATMENT EFFECT ESTIMATES"
STEP 7: TREATMENT EFFECT ESTIMATES

. di "======================================================================"
======================================================================

. 
. * Average treatment effect (post-treatment gap)
. sum gap_matched if year >= 2014

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 gap_matched |          6    .1294233    .0595416   .0327997   .2012224

. local ate = r(mean)

. local ate_sd = r(sd)

. di "Average Treatment Effect (log points): " %7.4f `ate'
Average Treatment Effect (log points):  0.1294

. di "  SD: " %7.4f `ate_sd'
  SD:  0.0595

. di "  Percentage: " %5.1f 100*(exp(`ate')-1) "%"
  Percentage:  13.8%

. 
. * By year
. di _n "=== Treatment Effect by Year ==="

=== Treatment Effect by Year ===

. list year gap_matched if year >= 2014

     +-----------------+
     | year   gap_ma~d |
     |-----------------|
  5. | 2014   .0327997 |
  6. | 2015   .1170483 |
  7. | 2016   .1205244 |
  8. | 2017   .1213284 |
  9. | 2018   .1836166 |
     |-----------------|
 10. | 2019   .2012224 |
     +-----------------+

. 
. ********************************************************************************
. * STEP 8: Limitations and Honest Assessment
. ********************************************************************************
. 
. di ""


. di "======================================================================"
======================================================================

. di "STEP 8: LIMITATIONS AND HONEST ASSESSMENT"
STEP 8: LIMITATIONS AND HONEST ASSESSMENT

. di "======================================================================"
======================================================================

. 
. di _n "Key limitations of this synthetic control analysis:"

Key limitations of this synthetic control analysis:

. di ""


. di "1. SMALL DONOR POOL: Only ~10 sectors available as donors,"
1. SMALL DONOR POOL: Only ~10 sectors available as donors,

. di "   vs. typical SC applications with 30-50 units."
   vs. typical SC applications with 30-50 units.

. di ""


. di "2. AGGREGATE SECTORS: We use sector-level averages, not firm-level"
2. AGGREGATE SECTORS: We use sector-level averages, not firm-level

. di "   or individual-level data. This masks within-sector heterogeneity."
   or individual-level data. This masks within-sector heterogeneity.

. di ""


. di "3. NO FORMAL OPTIMIZATION: We use ad-hoc weighting schemes rather than"
3. NO FORMAL OPTIMIZATION: We use ad-hoc weighting schemes rather than

. di "   Abadie et al.'s formal optimization of pre-treatment fit."
   Abadie et al.'s formal optimization of pre-treatment fit.

. di ""


. di "4. PRE-TREATMENT DIVERGENCE: Visual inspection shows some pre-2014"
4. PRE-TREATMENT DIVERGENCE: Visual inspection shows some pre-2014

. di "   divergence, though gaps are small relative to outcome variation."
   divergence, though gaps are small relative to outcome variation.

. di ""


. di "5. SECTOR COMPOSITION: Agriculture may have systematically different"
5. SECTOR COMPOSITION: Agriculture may have systematically different

. di "   wage dynamics than urban service sectors for structural reasons."
   wage dynamics than urban service sectors for structural reasons.

. 
. di _n "RECOMMENDATION:"

RECOMMENDATION:

. di "This analysis should be viewed as SUGGESTIVE rather than definitive."
This analysis should be viewed as SUGGESTIVE rather than definitive.

. di "The individual-level DiD event study remains the primary identification."
The individual-level DiD event study remains the primary identification.

. 
. ********************************************************************************
. * STEP 9: Export Results
. ********************************************************************************
. 
. keep year ln_wage_agri synth_simple synth_matched synth_weighted ///
>      gap_simple gap_matched gap_weighted

. 
. export delimited using "output/tables/synthetic_control_robust.csv", replace
(note: file output/tables/synthetic_control_robust.csv not found)
file output/tables/synthetic_control_robust.csv saved

. 
. di _n "Results saved to output/tables/synthetic_control_robust.csv"

Results saved to output/tables/synthetic_control_robust.csv

. 
. log close
      name:  <unnamed>
       log:  /Users/amalkova/Library/CloudStorage/OneDrive-FloridaInstituteofTechnology/Wo
> rking santctions/output/analysis_synthetic_control_robust_log.txt
  log type:  text
 closed on:   7 Feb 2026, 16:24:58
------------------------------------------------------------------------------------------
